<?php
//足球配置文件，请勿修改
return [
    //足球
    GAME_TYPE_FOOTBALL => [
        //玩法列表
        'list' => [
            RULES_TYPE_ASIAN => [
                'home' => '主胜',
                'handicap' => '让球',
                'guest' => '客胜',
            ],
            RULES_TYPE_EUROPE => [
                'home' => '主胜',
                'same' => '平局',
                'guest' => '客胜',
            ],
            RULES_TYPE_OU => [
                'home' => '大',
                'under' => '界值',
                'guest' => '小',
            ],
            RULES_TYPE_BODAN => [ //波胆
                'bd_1_0' => ['1:0',1,0],
                'bd_2_0' => ['2:0',2,0],
                'bd_2_1' => ['2:1',2,1],
                'bd_3_0' => ['3:0',3,0],
                'bd_3_1' => ['3:1',3,1],
                'bd_3_2' => ['3:2',3,2],
                'bd_4_0' => ['4:0',4,0],
                'bd_4_1' => ['4:1',4,1],
                'bd_4_2' => ['4:2',4,2],
                'bd_4_3' => ['4:3',4,3],
                'bd_0_0' => ['0:0',0,0],
                'bd_1_1' => ['1:1',1,1],
                'bd_2_2' => ['2:2',2,2],
                'bd_3_3' => ['3:3',3,3],
                'bd_4_4' => ['4:4',4,4],
                'other' => ['其它'],
            ],
            RULES_TYPE_BODAN_COMB => [ //波胆组合
                'bd_1' => ['1:0,2:0,3:0',[
                    [1,0],
                    [2,0],
                    [3,0],
                ]],
                'bd_2' => ['2:1,3:1,4:0',[
                    [2,1],
                    [3,1],
                    [4,0],
                ]],
                'bd_3' => ['3:2,4:1,4:2',[
                    [3,2],
                    [4,1],
                    [4,2],
                ]],
                //'bd_4' => ['其他'],
            ],
            RULES_TYPE_HOME_GOALS => [ //主队进球数
                'home_0' => ['0球',0,0],
                'home_1' => ['1球',1,1],
                'home_2' => ['2球',2,2],
                'home_3' => ['3球',3,3],
                'home_4' => ['4球',4,4],
                'home_5' => ['5球及以上',5,99],
            ],
            RULES_TYPE_GUEST_GOALS => [ //客队进球数；
                'guest_0' => ['0球',0,0],
                'guest_1' => ['1球',1,1],
                'guest_2' => ['2球',2,2],
                'guest_3' => ['3球',3,3],
                'guest_4' => ['4球',4,4],
                'guest_5' => ['5球及以上',5,99],
            ],
            RULES_TYPE_ALL_SCORE => [ //全场比分
                'score_1_0' => ['1:0',1,0],
                'score_2_0' => ['2:0',2,0],
                'score_3_0' => ['3:0',3,0],
                'score_3_1' => ['3:1',3,1],
                'score_3_2' => ['3:2',3,2],
                'score_4_0' => ['4:0',4,0],
            ],
            RULES_TYPE_HALF_SCORE => [ //半场比分
                'half_score_1_0' => ['1:0',1,0],
                'half_score_2_0' => ['2:0',2,0],
                'half_score_3_0' => ['1:1',1,1],
                'half_score_3_1' => ['2:2',2,2],
            ],
            RULES_TYPE_ALL_YELLOW => [ //全场黄牌总数
                'yellow_0' => ['0张',0,0],
                'yellow_1' => ['1张',1,1],
                'yellow_2' => ['2张',2,2],
                'yellow_3' => ['3张',3,3],
                'yellow_4' => ['4张',4,4],
                'yellow_5' => ['5张及以上',5,99],
            ],
            RULES_TYPE_FIRST_GOALS => [ //最先进球
                'home' => '主队',
                'guest' => '客队',
                'zero' => '没有入球',
            ],
            RULES_TYPE_ALL_GOALS => [ //全场进球
                'all_goals_0_1' => ['0至1球',0,1],
                'all_goals_2_3' => ['2至3球',2,3],
                'all_goals_4_6' => ['4至6球',4,6],
                'all_goals_7' => ['7球及以上',7,99],
            ],

            RULES_TYPE_SINGLE_DOUBLE => [ //单双
                'sd_1' => '单数',
                'sd_2' => '双数',
            ],
            RULES_TYPE_MAX_GOALS => [ //上半场进球较多； 上/下半场进球相同； 下半场进球较多；
                'max_goals_1' => '上半场较多',
                'max_goals_2' => '上/下半场相同',
                'max_goals_3' => '下半场较多',
            ],
        ],
        //赔率分主、客
        'com' => [RULES_TYPE_BODAN,RULES_TYPE_BODAN_COMB]
        
    ],
];